class View
  def welcome
    puts "   _____                      .__              .__   
  /     \\ _____ _______  ____ |__| ____ _____  |  |  
 /  \\ /  \\\\__  \\\\_  __ \\/ ___\\|  |/    \\\\__  \\ |  |  
/    Y    \\/ __ \\|  | \\/ /_/  >  |   |  \\/ __ \\|  |__
\\____|__  (____  /__|  \\___  /|__|___|  (____  /____/
        \\/     \\/     /_____/         \\/     \\/      
     ____   ____      .__                            
     \\   \\ /   /____  |  |   ________________        
      \\   Y   /\\__  \\ |  | _/ __ \\_  __ \\__  \\       
       \\     /  / __ \\|  |_\\  ___/|  | \\// __ \\_     
        \\___/  (____  /____/\\___  >__|  (____  /     
                    \\/          \\/           \\/      "
  end

  def actions
    puts "Выберите действие:\n1) Пойти на работу\n2) Созерцать природу\n3) Пить вино и смотреть сериал\n4) Сходить в бар\n5) Выпить с маргинальными личностями\n6) Петь в метро\n7) Спать\n8) Сохранить\n9) Загрузить\n10) Характеристики\n"
  end

  def stat(valera)
    puts "\nЗдоровье = #{valera.health}\nМана = #{valera.mana}\nДеньги = #{valera.money}\nЖизнерадостность = #{valera.happiness}\nУсталость = #{valera.fatigue}\n"
    puts "\n"
  end

  def dead
    puts "  ________                             
 /  _____/_____    _____   ____        
/   \\  ___\\__  \\  /     \\_/ __ \\       
\\    \\_\\  \\/ __ \\|  Y Y  \\  ___/       
 \\______  (____  /__|_|  /\\___  >      
        \\/     \\/      \\/     \\/       
               _______  __ ___________ 
              /  _ \\  \\/ // __ \\_  __ \\
             (  <_> )   /\\  ___/|  | \\/
              \\____/ \\_/  \\___  >__|   
                              \\/       \n"
  end
end
